{
  "changes": [
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "MultiProgressIndicator: Adding more slots that can be used to customize the display.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "MultiProgressIndicator: Adding a data attribute to each progress item row which can be queried against for further customizations.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "MultiProgressIndicator: The error message now renders inside of a QBtn.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "MultiProgressIndicator: This component is now also exported as MultiProgressIndicatorComponent for consistency with the other components.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "TimelineStepper: Adding ability to initially hide a step until it is started.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "TimelineStepper: Fixing bug where the skipped steps before didn't actually skip and ran the task instead. It should now just mark the step as skipped.",
      "type": "patch"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "TimelineStepper: This component is now also exported as TimelineStepper for consistency with other components.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "WizardStepper: Adding more slots that can be used to customize the display.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "WizardStepper: The navigational slots now also receives property to let it know when the user is done with the last step.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "WizardStepper: The default template for the navigational slots now hides the continue button when the last step is done and also shows a done button instead.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "WizardStepper: The default template for the navigational slots can now be configured to hide the back button when the user is in the last step and it is done.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "WizardStepper: Modifying execution to only call vue-router related features if it is actually used by user.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "WizardStepper: This component is now also exported as WizardStepper for consistency with other components.",
      "type": "minor"
    },
    {
      "packageName": "@ti-platform/aide-quasar",
      "comment": "Adding functionality to preview components during development to help with testing. Note I didn't want to include the huge dependencies of Storybook so just using Vite for this.",
      "type": "minor"
    },
  ],
  "packageName": "@ti-platform/aide-quasar"
}
